Core/src/src/Documents/ЗакупкаЛицензий/ЗакупкаЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаЛицензий</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.Лицензии</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Лицензии</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЛицензии</name>
      <type>
        <types>CatalogRef.СтавкаЛицензии</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ВозвратДенегОтПФ</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Documents/ЗакупкаЛицензий/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакупкаЛицензийЛицензии.Ссылка КАК Ссылка,
	|	ЗакупкаЛицензийЛицензии.НомерСтроки КАК НомерСтроки,
	|	ЗакупкаЛицензийЛицензии.Номенклатура КАК Номенклатура,
	|	ЗакупкаЛицензийЛицензии.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗакупкаЛицензийЛицензии.Цена КАК Цена,
	|	ЗакупкаЛицензийЛицензии.СтавкаНДС КАК СтавкаНДС,
	|	ЗакупкаЛицензийЛицензии.Всего КАК Всего,
	|	1 КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗакупкаЛицензийЛицензии.СтавкаНДС.Ставка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЗакупкаЛицензийЛицензии.Всего - ЗакупкаЛицензийЛицензии.Всего / (1 + ЗакупкаЛицензийЛицензии.СтавкаНДС.Ставка / 100)
	|	КОНЕЦ КАК СуммаНДС,
	|	ЗакупкаЛицензийЛицензии.Всего - ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗакупкаЛицензийЛицензии.СтавкаНДС.Ставка, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЗакупкаЛицензийЛицензии.Всего - ЗакупкаЛицензийЛицензии.Всего / (1 + ЗакупкаЛицензийЛицензии.СтавкаНДС.Ставка / 100)
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчетПред
	|ИЗ
	|	Документ.ЗакупкаЛицензий.Лицензии КАК ЗакупкаЛицензийЛицензии
	|ГДЕ
	|	ЗакупкаЛицензийЛицензии.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчетПред.СуммаНДС КАК СуммаНДС,
	|	1 КАК КоличествоСтрок,
	|	ВременнаяТаблицаЗапасыПерерасчетПред.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт_ЗапасыГрупп
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчетПред
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаЗапасыПерерасчет.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаЗапасыПерерасчет.Цена КАК Цена,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Всего КАК Всего,
	|	ВременнаяТаблицаЗапасыПерерасчет.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВременнаяТаблицаЗапасыПерерасчет.Сумма КАК ЧИСЛО(15, 8)) КАК Сумма,
	|	ВременнаяТаблицаЗапасыПерерасчет.Проект КАК Проект
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасыПерерасчет
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчетПред КАК ВременнаяТаблицаЗапасыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакупкаЛицензийПредоплата.Ссылка КАК Ссылка,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаРасчетов) КАК СуммаРасчетов,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаРасчетов * ЗакупкаЛицензийПредоплата.Курс / ЗакупкаЛицензийПредоплата.Кратность) КАК СуммаРасчетовРеглПоКурсуПредоплаты,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаНДФЛ) КАК СуммаНДФЛ,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаНДФЛ * ЗакупкаЛицензийПредоплата.Курс / ЗакупкаЛицензийПредоплата.Кратность) КАК СуммаНДФЛРеглПоКурсуПредоплаты,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаПФ) КАК СуммаПФ,
	|	СУММА(ЗакупкаЛицензийПредоплата.СуммаПФ * ЗакупкаЛицензийПредоплата.Курс / ЗакупкаЛицензийПредоплата.Кратность) КАК СуммаПФРеглПоКурсуПредоплаты
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаПредоплатыГрупп
	|ИЗ
	|	Документ.ЗакупкаЛицензий.Предоплата КАК ЗакупкаЛицензийПредоплата
	|ГДЕ
	|	ЗакупкаЛицензийПредоплата.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакупкаЛицензийПредоплата.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакупкаЛицензий.Ссылка КАК Ссылка,
	|	ЗакупкаЛицензий.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛ, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаПФ, 0) КАК СуммаНеОплаченаВал,
	|	(ЗакупкаЛицензий.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛ, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаПФ, 0)) * ЗакупкаЛицензий.Курс / ЗакупкаЛицензий.Кратность КАК СуммаНеОплаченаРегл,
	|	ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) КАК СуммаРасчетовВал,
	|	ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛ, 0) КАК СуммаРасчетовРегл,
	|	(ЗакупкаЛицензий.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛ, 0)) * ЗакупкаЛицензий.Курс / ЗакупкаЛицензий.Кратность + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) КАК СуммаДокументаРеглПоВсемКурсам,
	|	ВЫБОР
	|		КОГДА ЗакупкаЛицензий.СуммаДокумента = 0
	|			ТОГДА 1
	|		ИНАЧЕ ((ЗакупкаЛицензий.СуммаДокумента - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетов, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛ, 0) - ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаПФ, 0)) * ЗакупкаЛицензий.Курс / ЗакупкаЛицензий.Кратность + (ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаРасчетовРеглПоКурсуПредоплаты, 0) + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаНДФЛРеглПоКурсуПредоплаты, 0) + ЕСТЬNULL(ВременнаяТаблицаСуммаПредоплатыГрупп.СуммаПФРеглПоКурсуПредоплаты, 0))) / ЗакупкаЛицензий.СуммаДокумента
	|	КОНЕЦ КАК СреднийКурсДокумента,
	|	1 КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПредоплаты
	|ИЗ
	|	Документ.ЗакупкаЛицензий КАК ЗакупкаЛицензий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаПредоплатыГрупп КАК ВременнаяТаблицаСуммаПредоплатыГрупп
	|		ПО ЗакупкаЛицензий.Ссылка = ВременнаяТаблицаСуммаПредоплатыГрупп.Ссылка
	|ГДЕ
	|	ЗакупкаЛицензий.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Ссылка КАК Ссылка,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.Кратность КАК Кратность,
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты.СреднийКурсДокумента КАК Курс
	|ПОМЕСТИТЬ ВременнаяТаблицаСреднегоКурсаПоДокументу
	|ИЗ
	|	ВременнаяТаблицаСреднегоКурсаПредоплаты КАК ВременнаяТаблицаСреднегоКурсаПредоплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя КАК СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику КАК СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл КАК СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл КАК СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Ссылка.Организация КАК ОрганизацияВНУ,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДокумента.Ссылка.Договор КАК Договор,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ТаблицаДокумента.Заказ КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельностиПродажи,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетовКуда,
	|	&Ссылка КАК ДокументКуда,
	|	ТаблицаДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.АвансовыйОтчет)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.АвансовыйОтчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ КАК ДокументДата,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаРасчетов * ТаблицаДокумента.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * ТаблицаДокумента.Кратность) КАК ЧИСЛО(15, 8))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаРасчетов) КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Договор.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Договор.Проект
	|	КОНЕЦ КАК Проект
	|ПОМЕСТИТЬ ВременнаяТаблицаПредоплата
	|ИЗ
	|	Документ.ЗакупкаЛицензий.Предоплата КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчетаСрезПоследних
	|		ПО (КурсыВалютУчетаСрезПоследних.Валюта = &ВалютаУчета)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Документ,
	|	ТаблицаДокумента.Ссылка.Дата,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Договор,
	|	ТаблицаДокумента.Заказ,
	|	ТаблицаДокумента.Ссылка.Договор.ВалютаРасчетов,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПокупателяРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Ссылка.Контрагент.СчетУчетаАвансовПоставщикуРегл,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.АвансовыйОтчет)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТаблицаДокумента.Документ) = ТИП(Документ.Взаимозачет)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Статья
	|				КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|					ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Статья
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОплатаПоставщикам)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходСоСчета
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходСоСчета).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеНаСчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеНаСчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.ПоступлениеВКассу
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.ПоступлениеВКассу).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.РасходИзКассы
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.РасходИзКассы).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.АвансовыйОтчет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.АвансовыйОтчет).Дата
	|					КОГДА ТаблицаДокумента.Документ ССЫЛКА Документ.Взаимозачет
	|						ТОГДА ВЫРАЗИТЬ(ТаблицаДокумента.Документ КАК Документ.Взаимозачет).Дата
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Дата
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ТаблицаДокумента.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.Договор.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|		ИНАЧЕ ТаблицаДокумента.Ссылка.Договор.Проект
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка КАК Документ,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Организация КАК Организация,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Договор КАК Договор,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.ВидЦен КАК ВидЦен,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВременнаяТаблицаЗапасыПерерасчет.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблицаЗапасыПерерасчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаЗапасыПерерасчет.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС КАК СуммаНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Цена КАК Цена,
	|	ВременнаяТаблицаЗапасыПерерасчет.Всего КАК Себестоимость,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Курс КАК Курс,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Кратность КАК Кратность,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) КАК Проект,
	|	"""" КАК Содержание,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаЗапасыПерерасчет.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВременнаяТаблицаЗапасыПерерасчет.СуммаНДС * ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Поле1,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютный,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютныйРегл,
	|	ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВременнаяТаблицаЗапасыПерерасчет.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ВременнаяТаблицаЗапасыПерерасчет.Всего * КурсыРегВалюты.Курс * ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Кратность / (ВременнаяТаблицаЗапасыПерерасчет.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ВременнаяТаблицаЗапасыПерерасчет.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаВал,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасытест
	|ИЗ
	|	ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты,
	|	ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты,
	|	ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента,
	|	ВременнаяТаблицаЗапасыПерерасчет КАК ВременнаяТаблицаЗапасыПерерасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС КАК СсылкаСуммаВключаетНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Документ,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам КАК ВестиРасчетыПоЗаказам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам КАК ВестиУчетОплатыПоСчетам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВидЦен КАК ВидЦен,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗапасы.Всего КАК Себестоимость,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Курс КАК Курс,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Кратность КАК Кратность,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Поле1,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов.Валютный КАК СчетУчетаВалютный,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл.Валютный КАК СчетУчетаВалютныйРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов КАК КоррСчетУчета,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл КАК КоррСчетУчетаРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	1 КАК Количество,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДС,
	|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком КАК СчетУчетаРасчетовСПоставщиком,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРасчетовСПоставщикомРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютный,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Валютный КАК СчетУчетаРасчетовСПоставщикомВалютныйРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСВал,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаНДСЗакупкиПродажи,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК Сумма,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)) КАК СуммаБезНДСВал,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл КАК СчетУчетаПродажиВозвратРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл КАК СчетУчетаСебестоимостьРегл,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка) КАК Партия,
	|	ПриходнаяНакладнаяЗапасы.Проект КАК Проект,
	|	"""" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	ВременнаяТаблицаЗапасыПерерасчет КАК ПриходнаяНакладнаяЗапасы,
	|	ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыРегВалюты,
	|	ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыУпрВалюты,
	|	ВременнаяТаблицаСреднегоКурсаПоДокументу КАК СреднийКурсДокумента,
	|	РегистрСведений.УчетнаяПолитикаРегл КАК УчетнаяПолитикаРегл
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяЗапасы.Ссылка,
	|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
	|	ПриходнаяНакладнаяЗапасы.СтавкаНДС,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура,
	|	ПриходнаяНакладнаяЗапасы.НомерСтроки,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДоговорам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоДокументам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиРасчетыПоЗаказам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.ВестиУчетОплатыПоСчетам,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Дата,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Организация,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВидЦен,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента,
	|	ПриходнаяНакладнаяЗапасы.Всего,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.НалогообложениеНДС,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Курс,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Кратность,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов.Валютный,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл.Валютный,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗатратРегл,
	|	ПриходнаяНакладнаяЗапасы.Цена,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПоставщикомРегл.Валютный,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.Договор.ВалютаРасчетов,
	|	ПриходнаяНакладнаяЗапасы.Ссылка.ВидНалогаНДС,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродажРегл,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.Всего * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА (ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС) * КурсыРегВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность / (ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыРегВалюты.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.Всего - ПриходнаяНакладнаяЗапасы.СуммаНДС
	|		КОНЕЦ КАК ЧИСЛО(15, 8)),
	|	ПриходнаяНакладнаяЗапасы.Ссылка.СуммаВключаетНДС,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасов,
	|	ПриходнаяНакладнаяЗапасы.Номенклатура.СчетУчетаЗапасовРегл,
	|	ПриходнаяНакладнаяЗапасы.Проект,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
	|			КОГДА ПриходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента <> &ВалютаНациональная
	|					И НЕ &ПоКурстуДокумента
	|				ТОГДА ПриходнаяНакладнаяЗапасы.СуммаНДС * СреднийКурсДокумента.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * СреднийКурсДокумента.Кратность)
	|			ИНАЧЕ ПриходнаяНакладнаяЗапасы.СуммаНДС * ПриходнаяНакладнаяЗапасы.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ПриходнаяНакладнаяЗапасы.Ссылка.Кратность)
	|		КОНЕЦ КАК ЧИСЛО(15, 8))";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗакупкаЛицензии);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.Дляпроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаНациональная", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПоКурстуДокумента", Константы.ОприходованиеТоворовПоКурсуДокумента.Получить());
    Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	
	Запрос.ВыполнитьПакет();
	
	
	// Формирование проводок документа.
	УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства);

	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПодготовитьСтруктурыСубконтоСчетовДоходаПродажи(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства); //+++ Дмгг
	//СформироватьТаблицаЛицензии(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗакупки(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ЗакупкаЛицензии(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства);

	
КонецПроцедуры

Процедура СформироватьТаблицаЗакупки(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗакупки.Период КАК Период,
	|	ТаблицаЗакупки.Организация КАК Организация,
	|	ТаблицаЗакупки.Номенклатура КАК Номенклатура,
	|	ТаблицаЗакупки.Характеристика КАК Характеристика,
	|	ТаблицаЗакупки.Партия КАК Партия,
	|	ТаблицаЗакупки.Документ КАК Документ,
	|	ТаблицаЗакупки.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ТаблицаЗакупки.СуммаБезНДС) КАК Себестоимость,
	|	ВЫРАЗИТЬ(ТаблицаЗакупки.Содержание КАК СТРОКА(500)) КАК Содержание,
	|	ТаблицаЗакупки.Проект КАК Проект,
	|	СУММА(ТаблицаЗакупки.СуммаНДС) КАК СуммаНДС,
	|	ТаблицаЗакупки.Количество КАК Количество,
	|	ТаблицаЗакупки.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗакупки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗакупки.Период,
	|	ТаблицаЗакупки.СуммаВключаетНДС,
	|	ТаблицаЗакупки.Организация,
	|	ТаблицаЗакупки.Номенклатура,
	|	ТаблицаЗакупки.Характеристика,
	|	ТаблицаЗакупки.Партия,
	|	ТаблицаЗакупки.Документ,
	|	ТаблицаЗакупки.СтавкаНДС,
	|	ВЫРАЗИТЬ(ТаблицаЗакупки.Содержание КАК СТРОКА(500)),
	|	ТаблицаЗакупки.Проект,
	|	ТаблицаЗакупки.Количество,
	|	ТаблицаЗакупки.Сумма";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗакупки = РезультатЗапроса.Выгрузить();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗакупки",ТаблицаЗакупки); 
	
	
КонецПроцедуры // СформироватьТаблицаЗакупки()

Процедура СформироватьТаблицаРасчетыСПоставщиками(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗакупкаЛицензии);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПередПоставщиком", НСтр("ka='მომწოდებლის წინაშე ვალდებულებების წარმოშობა';ru='Возникновение обязательств перед поставщиком';en='The emergence of obligations to the supplier'"));
	Запрос.УстановитьПараметр("ЗачетАванса", НСтр("ka='წინასწარ გადახდილი თანხის ჩათვლა';ru='Зачет предоплаты';en='Зачет предоплаты'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	//Паганини: Скоректирован запрос и добавленны суммы НДФЛ;
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Дата,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам КАК ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	0 КАК СуммаНДФЛ,
	|	0 КАК СуммаНДФЛВал,
	|	ВЫРАЗИТЬ(&ВозникновениеОбязательствПередПоставщиком КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ТаблицаДокумента.Проект КАК Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.пустаяссылка) КАК Заказ
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПоставщиками
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Проект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетов,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
	|	ТаблицаДокумента.Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.пустаяссылка)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ТипРасчетов,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщику,
	|	ТаблицаДокумента.СчетУчетаАвансовПоставщикуРегл,
	|	ТаблицаДокумента.Проект
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	СУММА(ТаблицаДокумента.Сумма),
	|	СУММА(ТаблицаДокумента.СуммаВал),
	|	-СУММА(ТаблицаДокумента.Сумма),
	|	-СУММА(ТаблицаДокумента.СуммаВал),
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(&ЗачетАванса КАК СТРОКА(100)),
	|	ТаблицаДокумента.Проект,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.пустаяссылка)
	|ИЗ
	|	ВременнаяТаблицаПредоплата КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.ВестиРасчетыПоДокументам,
	|	ТаблицаДокумента.Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.ДокументКуда
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщиком,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПоставщикомРегл,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.ТипРасчетовКуда,
	|	ТаблицаДокумента.Проект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	ТипРасчетов,
	|	СчетУчета,
	|	СчетУчетаРегл,
	|	Проект";
	//--- Дмгг
	
	Запрос.Выполнить();
	
	//// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ВременнаяТаблицаРасчетыСПоставщиками.Организация КАК Организация,
	//|	ВременнаяТаблицаРасчетыСПоставщиками.Контрагент КАК Контрагент,
	//|	ВременнаяТаблицаРасчетыСПоставщиками.Договор КАК Договор,
	//|	ВременнаяТаблицаРасчетыСПоставщиками.Документ КАК Документ,
	////|	ВременнаяТаблицаРасчетыСПоставщиками.Заказ КАК Заказ,
	//|	ВременнаяТаблицаРасчетыСПоставщиками.ТипРасчетов КАК ТипРасчетов
	//|ИЗ
	//|	ВременнаяТаблицаРасчетыСПоставщиками КАК ВременнаяТаблицаРасчетыСПоставщиками";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками");
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	//
	//Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
	//	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	//КонецЦикла;
	//Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщиками(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПоставщикамиРегл(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаЗакупкаЛицензии, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаЗапасы.Период КАК Период,
	|	ТаблицаЗапасы.Организация КАК Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС КАК ВидНалога,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаЗапасы.СуммаНДС КАК ЧИСЛО(18, 2))) КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасы
	|ГДЕ
	|	ТаблицаЗапасы.СуммаНДС <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасы.Период,
	|	ТаблицаЗапасы.Организация,
	|	ТаблицаЗапасы.ВидНалогаНДС";
		
	Запрос.УстановитьПараметр("НачислениеНалога", НСтр("ka='გადასახადის დარიცხვა';ru='Начисление налога';en='tax accrual'"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", РезультатЗапроса[0].Выгрузить());
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНДФЛ", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаЗакупкаЛицензии, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь, ПроверятьИтогиРегистров = ЛОЖЬ) Экспорт
	
	Если НЕ УправлениеНебольшойФирмойСервер.ВыполнитьКонтрольОстатков() Тогда
		Возврат;
	КонецЕсли;
	
	// МобильноеПриложение
	Если МобильноеПриложениеВызовСервера.НужноОграничитьФункциональность() Тогда
		Возврат;
	КонецЕсли;
	// Конец МобильноеПриложение
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы "ДвиженияЗапасыИзменение", "ДвиженияЗапасыНаСкладахИзменение", 
	// "ДвиженияЗапасыКПоступлениюНаСкладыИзменение", "ДвиженияЗапасыПереданныеИзменение",
	// "ДвиженияЗапасыПринятыеИзменение", "ДвиженияРазмещениеЗаказовИзменение",
	// "ДвиженияПотребностьВЗапасахИзменение" содержат записи, необходимо выполнить контроль 
	// реализации товаров.
	Если  СтруктураВременныеТаблицы.ДвиженияРасчетыСПоставщикамиИзменение
		Тогда
		         
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияРасчетыСПоставщикамиИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Организация КАК ОрганизацияПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Контрагент КАК КонтрагентПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор КАК ДоговорПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Документ КАК ДокументПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.Заказ КАК ЗаказПредставление,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
		|	ЛОЖЬ КАК ДвиженияДенежныхДокументов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалПриЗаписи - ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВыданныхАвансов,
		|	ДвиженияРасчетыСПоставщикамиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаНепогашеннойЗадолженности,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
		|	ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов КАК ТипРасчетов
		|ИЗ
		|	ДвиженияРасчетыСПоставщикамиИзменение КАК ДвиженияРасчетыСПоставщикамиИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(&МоментКонтроля, ) КАК РасчетыСПоставщикамиОстатки
		|		ПО ДвиженияРасчетыСПоставщикамиИзменение.Организация = РасчетыСПоставщикамиОстатки.Организация
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Контрагент = РасчетыСПоставщикамиОстатки.Контрагент
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Договор = РасчетыСПоставщикамиОстатки.Договор
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Документ = РасчетыСПоставщикамиОстатки.Документ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.Заказ = РасчетыСПоставщикамиОстатки.Заказ
		|			И ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = РасчетыСПоставщикамиОстатки.ТипРасчетов
		|			И (ВЫБОР
		|				КОГДА ДвиженияРасчетыСПоставщикамиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
		|					ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) > 0
		|				ИНАЧЕ ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаВалОстаток, 0) < 0
		|			КОНЕЦ)");
		
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Если НЕ ПроверятьИтогиРегистров Тогда 
			Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		Иначе 
			Запрос.УстановитьПараметр("МоментКонтроля", Дата(2999,12,31));
		КонецЕсли;
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
	
			
		Если НЕ МассивРезультатов[0].Пустой()
			Тогда		
			ДокументОбъектЗакупкаЛицензии = ДокументСсылкаЗакупкаЛицензии.ПолучитьОбъект()
			
		КонецЕсли;
		
			
		// Отрицательный остаток по расчетам с поставщиками.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			Если НЕ ПроверятьИтогиРегистров Тогда 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ);
			Иначе 
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПоставщиками(ДокументОбъектЗакупкаЛицензии, ВыборкаИзРезультатаЗапроса, Отказ, , Истина);
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры // ВыполнитьКонтроль()
